xmltvExample.xml

<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
       
    <s:Header />
       
    <s:Body>
             
        <IngestKalturaEpg xmlns="http://tempuri.org/">
                     
            <!--Optional:-->
                     
            <request xmlns:i="http://www.w3.org/2001/XMLSchema-instance">
                           
                <!--Optional:-->
                           
                <userName xmlns="">QABE - Regular-main</userName>
                           
                <!--Optional:-->
                           
                <passWord xmlns="">QABE - Regular-main</passWord>
                           
                <!--Optional:-->
                           
                <data xmlns="">
                    <![CDATA[]]>
                </data>
                         
            </request>
                 
        </IngestKalturaEpg>
           
    </s:Body>
</s:Envelope> 